README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-04-23 Wed 16:48 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>subtitles made easy</title>
<meta name="author" content="likith" />
<meta name="generator" content="Org Mode" />

          <link rel="stylesheet" type="text/css" href="https://alhassy.github.io/org-special-block-extras/tooltipster/dist/css/tooltipster.bundle.min.css"/>
        
          <link rel="stylesheet" type="text/css" href="https://alhassy.github.io/org-special-block-extras/tooltipster/dist/css/plugins/tooltipster/sideTip/themes/tooltipster-sideTip-punk.min.css" />
        
        
        
        
          
          <link rel="stylesheet" type="text/css" href="https://alhassy.github.io/org-special-block-extras/tooltipster/dist/css/tooltipster.bundle.min.css"/>
        
          <link rel="stylesheet" type="text/css" href="https://alhassy.github.io/org-special-block-extras/tooltipster/dist/css/plugins/tooltipster/sideTip/themes/tooltipster-sideTip-punk.min.css" />
        
        
        
        
          
          <link rel="stylesheet" type="text/css" href="https://alhassy.github.io/org-special-block-extras/tooltipster/dist/css/tooltipster.bundle.min.css"/>
        
          <link rel="stylesheet" type="text/css" href="https://alhassy.github.io/org-special-block-extras/tooltipster/dist/css/plugins/tooltipster/sideTip/themes/tooltipster-sideTip-punk.min.css" />
        
        
        
        
          
          <link rel="stylesheet" type="text/css" href="https://alhassy.github.io/org-special-block-extras/tooltipster/dist/css/tooltipster.bundle.min.css"/>
        
          <link rel="stylesheet" type="text/css" href="https://alhassy.github.io/org-special-block-extras/tooltipster/dist/css/plugins/tooltipster/sideTip/themes/tooltipster-sideTip-punk.min.css" />
        
        
        
        
          
          <link rel="stylesheet" type="text/css" href="https://alhassy.github.io/org-special-block-extras/tooltipster/dist/css/tooltipster.bundle.min.css"/>
        
          <link rel="stylesheet" type="text/css" href="https://alhassy.github.io/org-special-block-extras/tooltipster/dist/css/plugins/tooltipster/sideTip/themes/tooltipster-sideTip-punk.min.css" />
        
        
        
        
          
          <link rel="stylesheet" type="text/css" href="https://alhassy.github.io/org-special-block-extras/tooltipster/dist/css/tooltipster.bundle.min.css"/>
        
          <link rel="stylesheet" type="text/css" href="https://alhassy.github.io/org-special-block-extras/tooltipster/dist/css/plugins/tooltipster/sideTip/themes/tooltipster-sideTip-punk.min.css" />
        
        
        
        
          
          <link rel="stylesheet" type="text/css" href="https://alhassy.github.io/org-special-block-extras/tooltipster/dist/css/tooltipster.bundle.min.css"/>
        
          <link rel="stylesheet" type="text/css" href="https://alhassy.github.io/org-special-block-extras/tooltipster/dist/css/plugins/tooltipster/sideTip/themes/tooltipster-sideTip-punk.min.css" />
        
        
        
        
          
          <link rel="stylesheet" type="text/css" href="https://alhassy.github.io/org-special-block-extras/tooltipster/dist/css/tooltipster.bundle.min.css"/>
        
          <link rel="stylesheet" type="text/css" href="https://alhassy.github.io/org-special-block-extras/tooltipster/dist/css/plugins/tooltipster/sideTip/themes/tooltipster-sideTip-punk.min.css" />
        
        
        
        
          
          <link rel="stylesheet" type="text/css" href="https://alhassy.github.io/org-special-block-extras/tooltipster/dist/css/tooltipster.bundle.min.css"/>
        
          <link rel="stylesheet" type="text/css" href="https://alhassy.github.io/org-special-block-extras/tooltipster/dist/css/plugins/tooltipster/sideTip/themes/tooltipster-sideTip-punk.min.css" />
        
        
        
        
</head>
<body>
<div id="content" class="content">
<h1 class="title">subtitles made easy</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgd5bd019">1. motivation</a></li>
<li><a href="#orgf46671f">2. usage</a></li>
<li><a href="#orgf596415">3. the process</a>
<ul>
<li><a href="#org0314fad">3.1. <code>shell.nix</code></a></li>
<li><a href="#orga252b82">3.2. <code>transcribe.py</code></a></li>
<li><a href="#org81b4adb">3.3. <code>new_subtitler.py</code></a></li>
<li><a href="#orga1b4e88">3.4. final ffmpeg command</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgd5bd019" class="outline-2">
<h2 id="orgd5bd019"><span class="section-number-2">1.</span> motivation</h2>
<div class="outline-text-2" id="text-1">
<p>
I wanted to automate the generation and burning in subtitles for video files, using free and open-source tooling, in a way that is repeatable, and easily scalable or deployable to batches of files. Yes, there are other apps that are able to do this, like adobe, and even kdenlive does have the functionality to do this. But with kdenlive, I always found its handling of executables to be a bit unreliable, especially with NixOS.
</p>
</div>
</div>
<div id="outline-container-orgf46671f" class="outline-2">
<h2 id="orgf46671f"><span class="section-number-2">2.</span> usage</h2>
<div class="outline-text-2" id="text-2">
<p>
simply make the <code>run.sh</code> file executable by running
</p>

<div class="org-src-container">
<pre class="src src-shell">sudo chmod +x run.sh
</pre>
</div>

<p>
create the nix shell if needed by running
</p>

<div class="org-src-container">
<pre class="src src-shell">nix-shell
</pre>
</div>

<p>
or provide the requirements using an alternative package manager like <code>pacman</code> or <code>pip</code> 
</p>

<p>
and run the file once the requirements are available in <code>$PATH</code> or <code>$PYTHONPATH</code> as applicable
</p>

<div class="org-src-container">
<pre class="src src-shell">bash run.sh
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf596415" class="outline-2">
<h2 id="orgf596415"><span class="section-number-2">3.</span> the process</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org0314fad" class="outline-3">
<h3 id="org0314fad"><span class="section-number-3">3.1.</span> <code>shell.nix</code></h3>
<div class="outline-text-3" id="text-3-1">
<p>
first, the <code>shell.nix</code> file helps create a nix shell with the required dependencies. Simply run
</p>

<div class="org-src-container">
<pre class="src src-shell">nix-shell
</pre>
</div>

<p>
in the project directory to create a nix shell with the required python dependencies.
</p>
</div>
</div>
<div id="outline-container-orga252b82" class="outline-3">
<h3 id="orga252b82"><span class="section-number-3">3.2.</span> <code>transcribe.py</code></h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>this file expects a video file named <code>kden_out.mp4</code> in the project directory. Feel free to modify the <code>input_video</code> variable as needed</li>
<li>it also expects a <code>subtitles.ass</code> file to be present in the project directory. From here, it just takes header information to be able to generate the final subtitles file(s).</li>
<li>once this runs successfully, a <code>subtitles_final_phrase.ass</code> file is generated containing the subtitles in the <code>.ass</code> format.</li>
<li><p>
if uniform subtitles are what you need, i.e., all the generated subtitles follow the same style, then, you can just burn the subtitles in <code>subtitles_final_phrase.ass</code> onto the video file using:
</p>

<div class="org-src-container">
<pre class="src src-shell">ffmpeg -hide_banner -y -i kden_out.mp4 -vf "subtitles=subtitles_final_phrase.ass" -c:a copy -preset veryslow reel.mp4
</pre>
</div></li>
</ul>
<p>
or a modified version with certain style elements changed using
</p>

<div class="org-src-container">
<pre class="src src-shell">ffmpeg -hide_banner -y -i kden_out.mp4 -vf "subtitles=subtitles_final_phrase.ass:force_style='Fontname=Roboto,PrimaryColor=white,Fontsize=100,MarginV=200,BorderStyle=3'" -c:a copy -preset veryslow reel.mp4
</pre>
</div>
</div>
</div>
<div id="outline-container-org81b4adb" class="outline-3">
<h3 id="org81b4adb"><span class="section-number-3">3.3.</span> <code>new_subtitler.py</code></h3>
<div class="outline-text-3" id="text-3-3">
<p>
this file generates subtitles, 3 lines at a time, with different styles, to make the final video more visually engaging. Simply run
</p>

<div class="org-src-container">
<pre class="src src-shell">python new_subtitler.py
</pre>
</div>
<p>
to generate <code>new_subtitles.ass</code>
</p>
</div>
</div>
<div id="outline-container-orga1b4e88" class="outline-3">
<h3 id="orga1b4e88"><span class="section-number-3">3.4.</span> final ffmpeg command</h3>
<div class="outline-text-3" id="text-3-4">
<p>
finally, to burn in the generated subtitles, run
</p>

<div class="org-src-container">
<pre class="src src-shell">ffmpeg -hide_banner -y -i kden_out.mp4 -vf "subtitles=new_subtitles.ass" -c:a copy -preset veryslow reel.mp4
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: likith</p>
<p class="date">Created: 2025-04-23 Wed 16:48</p>
</div>
</body>
</html>
